<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"07e36b4e77d979039785e1db75e3067fded7466334ea75d84044f0c2f7b4b107","plan_job_ref":"Job Terraform Plan #437 at https://github.com/cal-itp/data-infra/actions/runs/16765245758","plan_out_hash":"966d987299fd33345a3ec7cbf430919200a16f33b9dbf0d1b9fe2af005f9a12c","plan_hash":"1fcf861a049a857982b739ec9cd5013266973a1c23930ab8b40d6aec8293e828","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/cloud-functions/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_cloudfunctions2_function.update_expired_airtable_issues will be updated in-place
!~  resource "google_cloudfunctions2_function" "update_expired_airtable_issues" {
        id               = "projects/cal-itp-data-infra/locations/us-west2/functions/update-expired-airtable-issues-tf2"
        name             = "update-expired-airtable-issues-tf2"
#        (11 unchanged attributes hidden)

!~      service_config {
!~          service                          = "projects/cal-itp-data-infra/locations/us-west2/services/update-expired-airtable-issues-tf2" -> "update-expired-airtable-issues-tf-service"
#            (15 unchanged attributes hidden)

#            (3 unchanged blocks hidden)
        }

#        (1 unchanged block hidden)
    }

  # google_storage_bucket_object.update-expired-airtable-issues will be updated in-place
!~  resource "google_storage_bucket_object" "update-expired-airtable-issues" {
!~      crc32c              = "nGiYLA==" -> (known after apply)
!~      detect_md5hash      = "4r7/8fZJJJGV6xhie5n6nw==" -> "different hash"
!~      generation          = 1754443176103124 -> (known after apply)
        id                  = "cal-itp-data-infra-cf-source-tf-update-expired-airtable-issues.zip"
!~      md5hash             = "4r7/8fZJJJGV6xhie5n6nw==" -> (known after apply)
        name                = "update-expired-airtable-issues.zip"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #437](https://github.com/cal-itp/data-infra/actions/runs/16765245758)